In [16]:
#importacion de las librerias
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [23]:
# Configura la opción de visualización para mostrar todas las columnas del DataFrame, sin limitaciones.
pd.set_option('display.max_columns', None)

In [24]:
## 2. importacion de los datos Customer Flight Analysis.csv

df_vuelos_clientes = pd.read_csv("./Files./Customer_Flight_Activity.csv", index_col=0)# La primera columna del archivo será utilizada como índice.
df_vuelos_clientes.head()

,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
Loyalty Number,,,,,,,,,
100018,2017,1,3,0,3,1521,152.0,0,0
100102,2017,1,10,4,14,2030,203.0,0,0
100140,2017,1,6,0,6,1200,120.0,0,0
100214,2017,1,0,0,0,0,0.0,0,0
100272,2017,1,0,0,0,0,0.0,0,0

In [25]:
# Mostrar número de filas y columnas.
df_vuelos_clientes.shape

(405624, 9)

In [28]:
# Muestra los nombres de todas las columnas.
df_vuelos_clientes.columns

Index(['Year', 'Month', 'Flights Booked', 'Flights with Companions',
       'Total Flights', 'Distance', 'Points Accumulated', 'Points Redeemed',
       'Dollar Cost Points Redeemed'],
      dtype='object')

In [ ]:
# Genera un resumen estadístico de las columnas numéricas del DataFrame.El dataframe es solo numérico, no se puede mirar el resumen estadistico en las columnas categóricas.
df_vuelos_clientes.describe().T

,count,mean,std,min,25%,50%,75%,max
Year,405624.0,2017.500000,0.500001,2017.0,2017.00,2017.5,2018.00,2018.0
Month,405624.0,6.500000,3.452057,1.0,3.75,6.5,9.25,12.0
Flights Booked,405624.0,4.115052,5.225518,0.0,0.00,1.0,8.00,21.0
Flights with Companions,405624.0,1.031805,2.076869,0.0,0.00,0.0,1.00,11.0
Total Flights,405624.0,5.146858,6.521227,0.0,0.00,1.0,10.00,32.0
Distance,405624.0,1208.880059,1433.155320,0.0,0.00,488.0,2336.00,6293.0
Points Accumulated,405624.0,123.692721,146.599831,0.0,0.00,50.0,239.00,676.5
Points Redeemed,405624.0,30.696872,125.486049,0.0,0.00,0.0,0.00,876.0
Dollar Cost Points Redeemed,405624.0,2.484503,10.150038,0.0,0.00,0.0,0.00,71.0

In [ ]:
#muestra los valores nulos
df_vuelos_clientes.isnull().sum()

Year                           0
Month                          0
Flights Booked                 0
Flights with Companions        0
Total Flights                  0
Distance                       0
Points Accumulated             0
Points Redeemed                0
Dollar Cost Points Redeemed    0
dtype: int64

In [30]:
# Muestra el tipo de dato de cada columna.
df_vuelos_clientes.dtypes

Year                             int64
Month                            int64
Flights Booked                   int64
Flights with Companions          int64
Total Flights                    int64
Distance                         int64
Points Accumulated             float64
Points Redeemed                  int64
Dollar Cost Points Redeemed      int64
dtype: object

In [ ]:
df_vuelos_clientes["Points Redeemed"].dtype #controlar que son solo numeros enteros

dtype('int64')

In [64]:
df_vuelos_clientes["Dollar Cost Points Redeemed"].dtype #controlar que son solo numeros enteros

dtype('int64')

In [ ]:
df_vuelos_clientes["Month"].unique()#Comprobar que los numeros son del 1 al 12

array([ 1,  9,  2,  3, 11,  4,  5,  7,  6,  8, 10, 12], dtype=int64)

In [65]:
df_vuelos_clientes["Distance"].dtype #controlar que son solo numeros enteros

dtype('int64')

In [46]:
# Muestra el número total de filas duplicadas.
df_vuelos_clientes.duplicated().sum()

228705

In [ ]:
## cambiar el formato del mes de números a texto
## no hay valores nulos
## si hay duplicados

In [26]:
#Importación de los datos Customer Loyalty History.csv

df_datos_clientes = pd.read_csv('./files/Customer_Loyalty_History.csv', index_col=0)# La primera columna del archivo será utilizada como índice
df_datos_clientes.head()

,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
Loyalty Number,,,,,,,,,,,,,,,
480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,NaN,NaN
549612,Canada,Alberta,Edmonton,T3G 6Y6,Male,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN
429460,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Single,Star,3839.75,Standard,2014,7,2018.0,1.0
608370,Canada,Ontario,Toronto,P1W 1K4,Male,College,NaN,Single,Star,3839.75,Standard,2013,2,NaN,NaN
530508,Canada,Quebec,Hull,J8Y 3Z5,Male,Bachelor,103495.0,Married,Star,3842.79,Standard,2014,10,NaN,NaN

In [27]:
# Mostrar número de filas y columnas.
df_datos_clientes.shape

(16737, 15)

In [29]:
# Muestra los nombres de todas las columnas.
df_datos_clientes.columns

Index(['Country', 'Province', 'City', 'Postal Code', 'Gender', 'Education',
       'Salary', 'Marital Status', 'Loyalty Card', 'CLV', 'Enrollment Type',
       'Enrollment Year', 'Enrollment Month', 'Cancellation Year',
       'Cancellation Month'],
      dtype='object')

In [31]:
# Muestra el tipo de dato de cada columna.
df_datos_clientes.dtypes

Country                object
Province               object
City                   object
Postal Code            object
Gender                 object
Education              object
Salary                float64
Marital Status         object
Loyalty Card           object
CLV                   float64
Enrollment Type        object
Enrollment Year         int64
Enrollment Month        int64
Cancellation Year     float64
Cancellation Month    float64
dtype: object

In [ ]:
df_datos_clientes["Postal Code"].value_counts()#comprobar si el código postal era solo numerico

In [ ]:
df_datos_clientes["Gender"].value_counts() #Mirar si estan definidos como male y female

In [ ]:
df_datos_clientes["Education"].value_counts()#Mirar como estan definidos

In [ ]:
df_datos_clientes["Marital Status"].value_counts() #Mirar como estan definidos

Marital Status
Married     9735
Single      4484
Divorced    2518
Name: count, dtype: int64

In [ ]:
df_datos_clientes["Loyalty Card"].unique()#Mirar si indica el nivel

array(['Star', 'Aurora', 'Nova'], dtype=object)

In [45]:
# Muestra el número total de filas duplicadas.
df_datos_clientes.duplicated().sum()

0

In [59]:
#muestra los valores nulos
df_datos_clientes.isnull().sum()

Country                   0
Province                  0
City                      0
Postal Code               0
Gender                    0
Education                 0
Salary                 4238
Marital Status            0
Loyalty Card              0
CLV                       0
Enrollment Type           0
Enrollment Year           0
Enrollment Month          0
Cancellation Year     14670
Cancellation Month    14670
dtype: int64

In [66]:
# Genera un resumen estadístico de las columnas numéricas del DataFrame.
df_datos_clientes.describe().T

,count,mean,std,min,25%,50%,75%,max
Salary,12499.0,79245.609409,35008.297285,-58486.00,59246.50,73455.00,88517.50,407228.00
CLV,16737.0,7988.896536,6860.982280,1898.01,3980.84,5780.18,8940.58,83325.38
Enrollment Year,16737.0,2015.253211,1.979111,2012.00,2014.00,2015.00,2017.00,2018.00
Enrollment Month,16737.0,6.669116,3.398958,1.00,4.00,7.00,10.00,12.00
Cancellation Year,2067.0,2016.503145,1.380743,2013.00,2016.00,2017.00,2018.00,2018.00
Cancellation Month,2067.0,6.962748,3.455297,1.00,4.00,7.00,10.00,12.00

In [67]:
# Genera un resumen estadístico de las columnas categóricas del DataFrame.
df_datos_clientes.describe(include='object').T

                 count unique       top   freq
Country          16737      1    Canada  16737
Province         16737     11   Ontario   5404
City             16737     29   Toronto   3351
Postal Code      16737     55   V6E 3D9    911
Gender           16737      2    Female   8410
Education        16737      5  Bachelor  10475
Marital Status   16737      3   Married   9735
Loyalty Card     16737      3      Star   7637
Enrollment Type  16737      2  Standard  15766

In [ ]:
df_datos_clientes["Enrollment Month"].unique()#mirar si esta en números del 1 al 12

array([ 2,  3,  7, 10,  5,  6, 12,  1, 11,  8,  4,  9], dtype=int64)

In [ ]:
#Enrollment Month pasar de int a texto
#Cancellation Year,Cancellation Month eliminar por que la mayoria son nulos.
#Hay salarios negativos pasarlos a valor absoluto(no negativo)
#Hay salarios nulos, decidir que hacer con ellos